yerih/rt1064/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED_BOARD_GPIO                                               GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_LED_BOARD_GPIO_PIN                                              9U   /*!< GPIO pin number */
#define BOARD_LED_BOARD_GPIO_PIN_MASK                                 (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_LED_BOARD_PORT                                               GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_LED_BOARD_PIN                                                   9U   /*!< PORT pin number */
#define BOARD_LED_BOARD_PIN_MASK                                      (1U << 9U)   /*!< PORT pin mask */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_LCDIF_D14_PERIPHERAL                                          SAI1   /*!< Peripheral name */
#define BOARD_LCDIF_D14_SIGNAL                                       sai_tx_bclk   /*!< Signal name */

/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_LCDIF_D13_PERIPHERAL                                          SAI1   /*!< Peripheral name */
#define BOARD_LCDIF_D13_SIGNAL                                      sai_tx_data0   /*!< Signal name */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_LCDIF_D15_PERIPHERAL                                          SAI1   /*!< Peripheral name */
#define BOARD_LCDIF_D15_SIGNAL                                       sai_tx_sync   /*!< Signal name */

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
/* Routed pin properties */
#define BOARD_SEMC_A0_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A0_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A0_CHANNEL                                                 0U   /*!< Signal channel */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
/* Routed pin properties */
#define BOARD_SEMC_A1_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A1_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A1_CHANNEL                                                 1U   /*!< Signal channel */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
/* Routed pin properties */
#define BOARD_SEMC_A2_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A2_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A2_CHANNEL                                                 2U   /*!< Signal channel */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
/* Routed pin properties */
#define BOARD_SEMC_A3_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A3_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A3_CHANNEL                                                 3U   /*!< Signal channel */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
/* Routed pin properties */
#define BOARD_SEMC_A4_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A4_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A4_CHANNEL                                                 4U   /*!< Signal channel */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
/* Routed pin properties */
#define BOARD_SEMC_A5_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A5_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A5_CHANNEL                                                 5U   /*!< Signal channel */

/* GPIO_EMC_15 (coord B1), SEMC_A6 */
/* Routed pin properties */
#define BOARD_SEMC_A6_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A6_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A6_CHANNEL                                                 6U   /*!< Signal channel */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
/* Routed pin properties */
#define BOARD_SEMC_A7_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A7_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A7_CHANNEL                                                 7U   /*!< Signal channel */

/* GPIO_EMC_17 (coord A4), SEMC_A8 */
/* Routed pin properties */
#define BOARD_SEMC_A8_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A8_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A8_CHANNEL                                                 8U   /*!< Signal channel */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
/* Routed pin properties */
#define BOARD_SEMC_A9_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A9_SIGNAL                                                ADDR   /*!< Signal name */
#define BOARD_SEMC_A9_CHANNEL                                                 9U   /*!< Signal channel */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
/* Routed pin properties */
#define BOARD_SEMC_A10_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A10_SIGNAL                                               ADDR   /*!< Signal name */
#define BOARD_SEMC_A10_CHANNEL                                               10U   /*!< Signal channel */

/* GPIO_EMC_19 (coord B4), SEMC_A11 */
/* Routed pin properties */
#define BOARD_SEMC_A11_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A11_SIGNAL                                               ADDR   /*!< Signal name */
#define BOARD_SEMC_A11_CHANNEL                                               11U   /*!< Signal channel */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
/* Routed pin properties */
#define BOARD_SEMC_A12_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_A12_SIGNAL                                               ADDR   /*!< Signal name */
#define BOARD_SEMC_A12_CHANNEL                                               12U   /*!< Signal channel */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
/* Routed pin properties */
#define BOARD_SEMC_BA0_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_BA0_SIGNAL                                                 BA   /*!< Signal name */
#define BOARD_SEMC_BA0_CHANNEL                                                0U   /*!< Signal channel */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
/* Routed pin properties */
#define BOARD_SEMC_BA1_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_BA1_SIGNAL                                                 BA   /*!< Signal name */
#define BOARD_SEMC_BA1_CHANNEL                                                1U   /*!< Signal channel */

