yerih/rt1064/board/pin_mux.h
/* GPIO_EMC_34 (coord D4), SEMC_D12 */
/* Routed pin properties */
#define BOARD_SEMC_D12_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D12_SIGNAL                                               DATA   /*!< Signal name */
#define BOARD_SEMC_D12_CHANNEL                                               12U   /*!< Signal channel */

/* GPIO_EMC_35 (coord E5), SEMC_D13 */
/* Routed pin properties */
#define BOARD_SEMC_D13_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D13_SIGNAL                                               DATA   /*!< Signal name */
#define BOARD_SEMC_D13_CHANNEL                                               13U   /*!< Signal channel */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
/* Routed pin properties */
#define BOARD_SEMC_D14_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D14_SIGNAL                                               DATA   /*!< Signal name */
#define BOARD_SEMC_D14_CHANNEL                                               14U   /*!< Signal channel */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
/* Routed pin properties */
#define BOARD_SEMC_D15_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_D15_SIGNAL                                               DATA   /*!< Signal name */
#define BOARD_SEMC_D15_CHANNEL                                               15U   /*!< Signal channel */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
/* Routed pin properties */
#define BOARD_SEMC_DM0_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_DM0_SIGNAL                                                 DM   /*!< Signal name */
#define BOARD_SEMC_DM0_CHANNEL                                                0U   /*!< Signal channel */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
/* Routed pin properties */
#define BOARD_SEMC_DM1_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_DM1_SIGNAL                                                 DM   /*!< Signal name */
#define BOARD_SEMC_DM1_CHANNEL                                                1U   /*!< Signal channel */

/* GPIO_EMC_39 (coord B7), SEMC_DQS */
/* Routed pin properties */
#define BOARD_SEMC_DQS_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_DQS_SIGNAL                                           semc_dqs   /*!< Signal name */

/* GPIO_B1_13 (coord D14), WDOG_B */
/* Routed pin properties */
#define BOARD_WDOG_B_PERIPHERAL                                             SEMC   /*!< Peripheral name */
#define BOARD_WDOG_B_SIGNAL                                            semc_dqs4   /*!< Signal name */

/* GPIO_EMC_25 (coord D2), SEMC_RAS */
/* Routed pin properties */
#define BOARD_SEMC_RAS_PERIPHERAL                                           SEMC   /*!< Peripheral name */
#define BOARD_SEMC_RAS_SIGNAL                                           semc_ras   /*!< Signal name */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
/* Routed pin properties */
#define BOARD_SEMC_WE_PERIPHERAL                                            SEMC   /*!< Peripheral name */
#define BOARD_SEMC_WE_SIGNAL                                             semc_we   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
